## [Series 데이터 연산 ]

- (1) 모듈 로딩

In [383]:
import pandas as pd
import numpy as np

- (2) 데이터 준비

In [384]:
data = [5, 7, np.nan, 9, 11]

- (3) 데이터 저장 => 1차원 데이터로 Series에 저장

In [385]:
sr = pd.Series(data)

- (4) 데이터 확인

In [386]:
sr.index, sr.shape, sr.ndim, sr.dtypes
# 여기서 shape는 행도 열도 아님 1차원이라서 ㅇㅇ     # float이 뜨는 이유는 nan 때문에

(RangeIndex(start=0, stop=5, step=1), (5,), 1, dtype('float64'))

In [387]:
sr.values

array([ 5.,  7., nan,  9., 11.])

- (5) 연산 수행 => Series 객체 - 연산자 - 숫자

In [388]:
sr + 5

0    10.0
1    12.0
2     NaN
3    14.0
4    16.0
dtype: float64

In [389]:
sr - 5

0    0.0
1    2.0
2    NaN
3    4.0
4    6.0
dtype: float64

In [390]:
sr * 5

0    25.0
1    35.0
2     NaN
3    45.0
4    55.0
dtype: float64

In [391]:
sr / 5

0    1.0
1    1.4
2    NaN
3    1.8
4    2.2
dtype: float64

In [392]:
sr % 5

0    0.0
1    2.0
2    NaN
3    4.0
4    1.0
dtype: float64

In [393]:
sr // 5

0    1.0
1    1.0
2    NaN
3    1.0
4    2.0
dtype: float64

In [394]:
sr > 5

0    False
1     True
2    False
3     True
4     True
dtype: bool

In [395]:
sr == 5

0     True
1    False
2    False
3    False
4    False
dtype: bool

- 논리연산 => &: and 연산      | : or 연산        ~ : not 연산

In [396]:
(sr > 5) & (sr < 10)     # & => and 연산자

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [397]:
(sr > 5) | (sr < 10)

0     True
1     True
2    False
3     True
4     True
dtype: bool

In [398]:
print(~(sr > 5) , sr>5 , sep='\n\n')

0     True
1    False
2     True
3    False
4    False
dtype: bool

0    False
1     True
2    False
3     True
4     True
dtype: bool

- (5) 연산 수행 => Series 객체 + Series 객체

In [399]:
data2 = [2, 4, 6, 8, 9]

sr2 = pd.Series(data2)

In [400]:
sr2

0    2
1    4
2    6
3    8
4    9
dtype: int64

In [401]:
print(sr + sr2, sr-sr2, sr*sr2, sr/sr2, sr%sr2, sep='\n\n')

0     7.0
1    11.0
2     NaN
3    17.0
4    20.0
dtype: float64

0    3.0
1    3.0
2    NaN
3    1.0
4    2.0
dtype: float64

0    10.0
1    28.0
2     NaN
3    72.0
4    99.0
dtype: float64

0    2.500000
1    1.750000
2         NaN
3    1.125000
4    1.222222
dtype: float64

0    1.0
1    3.0
2    NaN
3    1.0
4    2.0
dtype: float64

In [402]:
print(sr>sr2, sr<sr2, sep='\n\n')

0     True
1     True
2    False
3     True
4     True
dtype: bool

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [403]:
sr2.index = [2,3,4,5,6]
sr2

2    2
3    4
4    6
5    8
6    9
dtype: int64

In [404]:
print(sr + sr2, sr-sr2, sr*sr2, sr/sr2, sr%sr2, sep='\n\n')      
#인덱스가 같은거 끼리 계산하니까!
#혼자만 인덱스가 존재하면 NaN 발생

0     NaN
1     NaN
2     NaN
3    13.0
4    17.0
5     NaN
6     NaN
dtype: float64

0    NaN
1    NaN
2    NaN
3    5.0
4    5.0
5    NaN
6    NaN
dtype: float64

0     NaN
1     NaN
2     NaN
3    36.0
4    66.0
5     NaN
6     NaN
dtype: float64

0         NaN
1         NaN
2         NaN
3    2.250000
4    1.833333
5         NaN
6         NaN
dtype: float64

0    NaN
1    NaN
2    NaN
3    1.0
4    5.0
5    NaN
6    NaN
dtype: float64

In [405]:
sr2.reset_index()
# 이렇게 하면 인덱스를 재지정하고 현재 인덱스를 컬럼으로 넣어줌 (데이터 프레임이 됨)

   index  0
0      2  2
1      3  4
2      4  6
3      5  8
4      6  9

In [406]:
sr2.reset_index(drop=True)
# 이렇게 하면 인덱스를 재지정하고 현재 인덱스를 컬럼으로 넣지않고 버림

0    2
1    4
2    6
3    8
4    9
dtype: int64

- (5) Series 연산 수행 => 전용 메서드

In [407]:
print(sr.add(5), sr.add(5, fill_value = 0), sep='\n\n')

0    10.0
1    12.0
2     NaN
3    14.0
4    16.0
dtype: float64

0    10.0
1    12.0
2     5.0
3    14.0
4    16.0
dtype: float64

In [408]:
print(sr.sub(5), sr.sub(5, fill_value = 0), sep='\n\n')

0    0.0
1    2.0
2    NaN
3    4.0
4    6.0
dtype: float64

0    0.0
1    2.0
2   -5.0
3    4.0
4    6.0
dtype: float64

In [409]:
print(sr.add(sr2), sr.add(sr2, fill_value = 0), sep='\n\n')

0     NaN
1     NaN
2     NaN
3    13.0
4    17.0
5     NaN
6     NaN
dtype: float64

0     5.0
1     7.0
2     2.0
3    13.0
4    17.0
5     8.0
6     9.0
dtype: float64

In [410]:
addSR = sr.add(sr2, fill_value = 0)
subSR = sr.sub(sr2, fill_value = 0)
mulSR = sr.mul(sr2, fill_value = 0)
divSR = sr.div(sr2, fill_value = 0)

print(addSR, subSR, mulSR, divSR, sep='\n\n')

0     5.0
1     7.0
2     2.0
3    13.0
4    17.0
5     8.0
6     9.0
dtype: float64

0    5.0
1    7.0
2   -2.0
3    5.0
4    5.0
5   -8.0
6   -9.0
dtype: float64

0     0.0
1     0.0
2     0.0
3    36.0
4    66.0
5     0.0
6     0.0
dtype: float64

0         inf
1         inf
2    0.000000
3    2.250000
4    1.833333
5    0.000000
6    0.000000
dtype: float64

(6) DataFrame 연산 수행

In [411]:
df = pd.DataFrame([addSR, subSR, mulSR, divSR], index = ['add', 'sub', 'mul', 'div'])
df

       0    1    2      3          4    5    6
add  5.0  7.0  2.0  13.00  17.000000  8.0  9.0
sub  5.0  7.0 -2.0   5.00   5.000000 -8.0 -9.0
mul  0.0  0.0  0.0  36.00  66.000000  0.0  0.0
div  inf  inf  0.0   2.25   1.833333  0.0  0.0

- DataFrame과 숫자 연산 수행

In [412]:
print(df+5, df-5, sep='\n\n')

        0     1    2      3          4     5     6
add  10.0  12.0  7.0  18.00  22.000000  13.0  14.0
sub  10.0  12.0  3.0  10.00  10.000000  -3.0  -4.0
mul   5.0   5.0  5.0  41.00  71.000000   5.0   5.0
div   inf   inf  5.0   7.25   6.833333   5.0   5.0

       0    1    2      3          4     5     6
add  0.0  2.0 -3.0   8.00  12.000000   3.0   4.0
sub  0.0  2.0 -7.0   0.00   0.000000 -13.0 -14.0
mul -5.0 -5.0 -5.0  31.00  61.000000  -5.0  -5.0
div  inf  inf -5.0  -2.75  -3.166667  -5.0  -5.0

In [413]:
print(df>5, sep='\n\n')

         0      1      2      3      4      5      6
add  False   True  False   True   True   True   True
sub  False   True  False  False  False  False  False
mul  False  False  False   True   True  False  False
div   True   True  False  False  False  False  False

- DataFrame과 DataFrame 연산 수행 => 동일 위치에 원소끼리 연산 수행

In [414]:
df2 = df * 10
df2

        0     1     2      3           4     5     6
add  50.0  70.0  20.0  130.0  170.000000  80.0  90.0
sub  50.0  70.0 -20.0   50.0   50.000000 -80.0 -90.0
mul   0.0   0.0   0.0  360.0  660.000000   0.0   0.0
div   inf   inf   0.0   22.5   18.333333   0.0   0.0

In [415]:
print(df+df2, df*df2, sep ='\n\n')

        0     1     2       3           4     5     6
add  55.0  77.0  22.0  143.00  187.000000  88.0  99.0
sub  55.0  77.0 -22.0   55.00   55.000000 -88.0 -99.0
mul   0.0   0.0   0.0  396.00  726.000000   0.0   0.0
div   inf   inf   0.0   24.75   20.166667   0.0   0.0

         0      1     2          3             4      5      6
add  250.0  490.0  40.0   1690.000   2890.000000  640.0  810.0
sub  250.0  490.0  40.0    250.000    250.000000  640.0  810.0
mul    0.0    0.0   0.0  12960.000  43560.000000    0.0    0.0
div    inf    inf   0.0     50.625     33.611111    0.0    0.0

In [416]:
df.index, df.columns

(Index(['add', 'sub', 'mul', 'div'], dtype='object'),
 Index([0, 1, 2, 3, 4, 5, 6], dtype='int64'))

In [417]:
df2.index, df2.columns

(Index(['add', 'sub', 'mul', 'div'], dtype='object'),
 Index([0, 1, 2, 3, 4, 5, 6], dtype='int64'))

In [418]:
df2.index=['add', 'minus','mul','/']

In [419]:
print(df+df2, df*df2, sep ='\n\n') #없는 인덱스는 계산할 수 없어서 Nan으로 처리됨.

          0     1     2      3      4     5     6
/       NaN   NaN   NaN    NaN    NaN   NaN   NaN
add    55.0  77.0  22.0  143.0  187.0  88.0  99.0
div     NaN   NaN   NaN    NaN    NaN   NaN   NaN
minus   NaN   NaN   NaN    NaN    NaN   NaN   NaN
mul     0.0   0.0   0.0  396.0  726.0   0.0   0.0
sub     NaN   NaN   NaN    NaN    NaN   NaN   NaN

           0      1     2        3        4      5      6
/        NaN    NaN   NaN      NaN      NaN    NaN    NaN
add    250.0  490.0  40.0   1690.0   2890.0  640.0  810.0
div      NaN    NaN   NaN      NaN      NaN    NaN    NaN
minus    NaN    NaN   NaN      NaN      NaN    NaN    NaN
mul      0.0    0.0   0.0  12960.0  43560.0    0.0    0.0
sub      NaN    NaN   NaN      NaN      NaN    NaN    NaN

- 연산 수행 메소드 활용 => 결측치 즉 NaN 빈칸에 대한 처리를 수행 가능
   * fill_value 파라미터에 값 설정.

In [420]:
df.add(df2, fill_value = 0)   #Nan 값에 0을 부여하면 계산 가능함

          0     1     2       3           4     5     6
/       inf   inf   0.0   22.50   18.333333   0.0   0.0
add    55.0  77.0  22.0  143.00  187.000000  88.0  99.0
div     inf   inf   0.0    2.25    1.833333   0.0   0.0
minus  50.0  70.0 -20.0   50.00   50.000000 -80.0 -90.0
mul     0.0   0.0   0.0  396.00  726.000000   0.0   0.0
sub     5.0   7.0  -2.0    5.00    5.000000  -8.0  -9.0

In [421]:
df.add(df2)        #이건 0을 부여하지 않아서 계산 못했기 때문에 NaN으로 나옴

          0     1     2      3      4     5     6
/       NaN   NaN   NaN    NaN    NaN   NaN   NaN
add    55.0  77.0  22.0  143.0  187.0  88.0  99.0
div     NaN   NaN   NaN    NaN    NaN   NaN   NaN
minus   NaN   NaN   NaN    NaN    NaN   NaN   NaN
mul     0.0   0.0   0.0  396.0  726.0   0.0   0.0
sub     NaN   NaN   NaN    NaN    NaN   NaN   NaN

In [422]:
sr.values

array([ 5.,  7., nan,  9., 11.])

In [423]:
sr.is_unique #요소들의 값을 비교해서 중복값이 있다면 False

True

In [424]:
sr = pd.Series([1, 6, 3, 9])
sr.is_monotonic_increasing #is_monotonic 오류남. 그래서 쟤로 대체

False

In [425]:
sr.head(2) #데이터가 많을 때 유용 (앞에서부터 n만큼 보여준다.)

0    1
1    6
dtype: int64

In [426]:
sr.tail(2) #데이터의 일부분을 볼 때 (뒤에서부터 n만큼 보여준다.)

2    3
3    9
dtype: int64

In [427]:
# nan은 빼고 출력
sr.count

<bound method Series.count of 0    1
1    6
2    3
3    9
dtype: int64>

In [428]:
sr

0    1
1    6
2    3
3    9
dtype: int64

In [429]:
sr.sum(skipna=True)
# skipna: 결과를 계산할 때 NA/null 값을 제외함 (기본값이 True)

19

In [430]:
sr.sum(skipna=False, numeric_only = False)
#numeric_only
#float, int, boolean 열만 포함해서 시리즈에는 구현ㄴㄴ. 기본값은 False

19